CSI API ETABS v1
eConstraintType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eConstraintType
Public Enumeration eConstraintType
Dim instance As eConstraintType
public enum class eConstraintType
type eConstraintType
Members
Member name | Value | Description
Body | 1
Diaphragm | 2
Plate | 3
Rod | 4
Beam | 5
Equal | 6
Local | 7
Weld | 8
Line | 13
See Also
Reference
ETABSv1 Namespace